{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 32, "batch_input_shape": [null, 64, 128, 1], "strides": [1, 1], "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "filters": 64, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "padding": "same", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "filters": 128, "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "padding": "same", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_3", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 500, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 500, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 4, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "name": "dense_3"}}]}